'''
Петя и Катя – брат и сестра. Петя – студент, а 
Катя – школьница. Петя помогает Кате по математике. 
Он задумывает два натуральных числа X и Y (X,Y≤1000), 
а Катя должна их отгадать. Для этого Петя делает две 
подсказки. Он называет сумму этих чисел S и их 
произведение P. 
Помогите Кате отгадать задуманные Петей числа.

'''

s = int(input("Введите сумму двух чисел: "))
p = int(input("Введите произведение двух чисел: "))
x = 'не определено'
y = 'не определено'

for i in range(100):
    for j in range(100):
        if i + j == s and i * j == p:
            x = i
            y = j
print("Первое число: " , x, ".Второе число: ", y)
        